Repository: LukasHoeschen/beStrongStopDistraction
Catalog: Be Strong, Stop Distraction/Localizable.xcstrings
Source language: en
Languages: de

source: %@, be strong, I know you can do this!
de: %@, sei stark, ich weiß du schaffst das!

source: %@, don't let distractions win!
de: %@, lass Zeitfresser nicht gewinnen!

source: %@, every small step counts!
de: %@, lass Zeitfresser nicht gewinnen!

source: %@, you've got this!
de: %@, Du schaffst das!

source: Add a new Automation
de: Füge eine neue Automation hinzu

source: All done!
de: Alles erledigt!

source: As a student, I don’t earn much, and keeping apps available on the App Store comes with costs. If you enjoy using "Be Strong, Stop Distraction", I’d really appreciate your support!
de: Als Student verdiene ich nicht viel, und die Apps im App Store verfügbar zu halten, kostet Geld. Wenn dir „Be Strong, Stop Distraction“ gefällt, würde ich mich sehr über deine Unterstützung freuen!

source: Automatically closes distracting apps after a customizable time limit. Starts a timer in the 'Be Strong, Stop Distraction' app, preventing you from reopening the distracting app until the timer finishes.
de: Schließt ablenkende Apps automatisch nach einer anpassbaren Zeitbegrenzung. Startet einen Timer in der „Be Strong, Stop Distraction“-App, der verhindert, dass du die ablenkende App wieder öffnest, bis der Timer abgelaufen ist.

source: Believe in yourself, %@!
de: Vertraue in dich selbst, %@!

source: Buy Me a Coffee
de: Kaufe mir einen Kaffee

source: Buy Me A Coffee
de: Kaufe mir einen Kaffee

source: Click "Next"
de: Tippe auf „Weiter“

source: Click on Automations
de: Tippe auf „Automationen“

source: Close distracting App in Lockdown Mode after %d Seconds
de: Schließe Zeitfresser-Apps im Lockdown Modus nach %d Sekunden

source: Congrats, you did it, %@. Please consider if you really want to continue being distracted.
de: Herzlichen Glückwunsch, %@! Wenn du wirklich willst, kannst du jetzt zum Zeitfresser zurückkehren.

source: Contact Me
de: Kontaktiere mich

source: Donate via [buyMeACoffee.com](https://buymeacoffee.com/hoeschenDevelopment)
de: Spende über [buyMeACoffee.com](https://buymeacoffee.com/hoeschenDevelopment)

source: Donate via [PayPal](https://paypal.me/hoeschenDevelopment)
de: Spende über [PayPal](https://paypal.me/hoeschenDevelopment)

source: Download Shortcut
de: Kurzbefehl herunterladen

source: Enables Strong Mode automatically and keeps it active for a set period.
de: Aktiviert den Starken Modus automatisch und hält ihn für einen festgelegten Zeitraum aktiv

source: Enter your name
de: Gib bitte deinen Namen ein

source: Enter Your Name
de: Gib deinen Namen an

source: Even dough you probably closed the distracting App, it's quite likely that "Be Strong, Stop Distraction" will be opened soon. This is because I cannot detect whether the app is still running. See the FAQ in Settings for more information.
de: Auch wenn du die Zeitfresser-App gerade geschlossen hast, kann es sein, dass „Be Strong, Stop Distraction“ bald geöffnet wird. Dies liegt daran, dass ich nicht erkennen kann, ob eine andere App immer noch geöffnet ist, wenn die Zeit abläuft. In den FAQ findest Du mehr dazu.

source: Finish Setup
de: Einrichtung abschließen

source: Focus on what matters most, %@!
de: Fokussiere dich auf die wichtigen Dinge, %@!

source: Frequently Asked Questions
de: Häufig gestellte Fragen

source: General
de: Generell

source: Here isn't a timer, because it seams like you didn't opened a distracting App for the last 30 Minutes. Congratulations
de: Hier ist kein Timer, da es so scheint, als hättest Du keinen Zeitfresser in den letzten 30 Minuten geöffnet. Sehr gut.

source: Hi there!
de: Hallo

source: Hi, my name is Lukas. I made this App to help me to close distracting Apps. I hope it helps you too! The App works with together with an Apple Shortcut to detect if a certain App was opened. If you spend to much time on that App, my App will open and the Timer will start. You then need to be strong an stay in my App until the timer is done, and hopefully you won't reopen the distracting App.
de: Hallo, mein Name ist Lukas. Ich habe diese App entwickelt, um mir zu helfen, ablenkende Apps zu schließen. Ich hoffe, sie hilft dir auch! Die App arbeitet zusammen mit einem Apple-Kurzbefehl, um zu erkennen, ob eine bestimmte App geöffnet wurde. Wenn du zu viel Zeit in dieser App verbringst, öffnet sich meine App, und der Timer startet. Dann musst du stark bleiben und in meiner App bleiben, bis der Timer abgelaufen ist – und hoffentlich öffnest du die ablenkende App danach nicht erneut.

source: How can I turn off the automation without deleting the app?
de: Wie kann ich die automation vorübergehend ausschalten, ohne die App zu löschen?

source: How does Flexible Usage work?
de: Wie funktioniert die Normale Nutzung?

source: How does the app work?
de: Wie funktioniert die App?

source: I like your app! How can I support you?
de: Ich mag deine App! Wie kann ich dich unterstützen?

source: I'm a Mechatronics student developing this app in my free time. If you like it, I'd really appreciate your support and I would love to hear your Feedback!
de: Ich bin Mechatronik-Student und entwickle diese App in meiner Freizeit. Wenn sie dir gefällt, würde ich mich sehr über deine Unterstützung und dein Feedback freuen!

source: I'm a Mechatronics student developing this app in my free time. If you like it, I'd really appreciate your support!
de: Ich studiere zur Zeit Mechatronik und habe diese App in meiner „Freizeit“ programmiert. Wenn sie Dir gefällt, werde ich mich sehr über deine Unterstützung und dein Feedback freuen!

source: If you close or leave the app while the timer is running, the timer will restart from the beginning the next time you open the app. This behavior is intentional to discourage bypassing the timer and to ensure a consistent focus on avoiding distractions.
de: Wenn du die App schließt oder verlässt, während der Timer läuft, wird der Timer beim nächsten Öffnen der App wieder von vorne starten. Dieses Verhalten ist beabsichtigt, um das Umgehen des Timers zu verhindern und eine konsequente Fokussierung auf die Vermeidung von Ablenkungen sicherzustellen.

source: If you open and then close a distracting app, 'Be Strong, Stop Distraction' will still open. This is because iOS doesn’t allow apps to check whether another app is still running, so this behavior ensures that distractions are minimized effectively.
de: Wenn du eine ablenkende App öffnest und dann schließt, wird „Be Strong, Stop Distraction“ trotzdem geöffnet. Das liegt daran, dass iOS es Apps nicht erlaubt, zu überprüfen, ob eine andere App noch läuft. Dieses Verhalten stellt sicher, dass Ablenkungen effektiv minimiert werden.

source: Information
de: Informationen

source: Is this project affiliated with TikTok or Instagram?
de: Ist dieses Projekt mit TikTok oder Instagram verbunden?

source: Keep going, %@, you're doing great!
de: Noch ein bisschen, %@!

source: Key
de: Schlüssel

source: Lockdown Mode
de: Lockdown Modus

source: Lockdown Mode End
de: Lockdown Modus endet

source: Lockdown Mode Settings
de: Lockdown Modus Einstellungen

source: Lockdown Mode Start
de: Lockdown Modus startet

source: My App isn't collecting any data at all of course and all Information you enter such as your Name are stored on your device.
de: Meine App sammelt selbstverständlich keine Daten, und alle Informationen, die du eingibst, wie z. B. dein Name, werden ausschließlich auf deinem Gerät gespeichert.

source: Next
de: Weiter

source: Next, open the Shortcuts App
de: Als nächstes öffne bitte die Kurzbefehle-App

source: No Data Collected
de: Sammelt keine Daten

source: No, this app is completely independent and not affiliated with any specific platform.
de: Nein, diese App ist völlig unabhängig und nicht mit einer bestimmten Plattform verbunden.

source: Now open one of the Distracting Apps. You should see following Dialog, please click "Allow"
de: Öffne nun eine der Zeitfresser-Apps. Du solltest folgenden Dialog sehen. Tippe bitte auf „Erlauben“

source: Now select all distracting Apps you want to limit. Make also sure to select "Run immediately".
de: Wähle nun alle Zeitfresser-Apps die Du limitieren willst. Wähle auch „Sofort ausführen“ aus.

source: One step at a time, %@!
de: %@, Du schaffst das!

source: Open the Shortcuts app, go to the 'Automations' tab, select the automation for your distracting app, and either delete it or toggle off 'Run Immediately'.
de: Öffne die Shortcuts-App, gehe zum Tab „Automatisierungen“, wähle die Automatisierung für deine ablenkende App aus und lösche sie entweder oder schalte „Sofort ausführen“ aus.

source: Or build the Shortcut on your own
de: Oder erstelle den Kurzbefehl selbst

source: Personalized Experience
de: Personalisiertes Erlebnis

source: Please follow these Steps to make the App work with Apple's Shortcuts.
de: Bitte folge diesen Schritten um die App mit Apple’s Kurzbefehlen zu verbinden.

source: Please load this Shortcut and click on "Add Shortcut"
de: Bitte lade diesen Kurzbefehl und tippe auf „Kurzbefehl hinzufügen“

source: Privacy
de: Privatsphäre

source: Secure & Private
de: Sicher & Privat

source: Select "Setup"
de: Wähle „Setup“ aus

source: Settings
de: Einstellungen

source: Setup
de: Einrichtung

source: Shortcut Integration
de: Kurzbefehle-Integration

source: Shortcut Setup
de: Kurzbefehl-Einrichtung

source: Since iOS doesn’t allow apps to detect when specific apps are opened, I implemented a workaround using Apple Shortcuts. Users set up an automation to run a shortcut whenever a specific app is opened. The app communicates with the shortcut to determine how long the distracting app should remain open before switching back to 'Be Strong, Stop Distraction.' This ensures high security and full control for the user.
de: Da iOS es Apps nicht erlaubt, zu erkennen, wann bestimmte Apps geöffnet werden, habe ich eine Umgehungslösung mit Apple Kurzbefehlen implementiert. Benutzer richten eine Automatisierung ein, die einen Kurzbefehl ausführt, wann immer eine bestimmte App geöffnet wird. Die App kommuniziert mit dem Kurzbefehl, um zu bestimmen, wie lange die ablenkende App geöffnet bleiben soll, bevor sie wieder zu ‘Be Strong, Stop Distraction’ wechselt. Dies gewährleistet hohe Sicherheit und vollständige Kontrolle für den Benutzer.

source: Start Setup
de: Einrichtung starten

source: Stay focused, %@!
de: Bleibe fokussiert, &@!

source: Step 1/10
de: Schritt 1/10

source: Step 2/10
de: Schritt 2/10

source: Step 3/10
de: Schritt 3/10

source: Step 4/10
de: Schritt 4/10

source: Step 5/10
de: Schritt 5/10

source: Step 6/10
de: Schritt 6/10

source: Step 7/10
de: Schritt 7/10

source: Step 8/10
de: Schritt 8/10

source: Step 9/10
de: Schritt 9/10

source: Step 10/10
de: Schritt 10/10

source: Step by Step Instruction
de: Schritt für Schritt Anleitung

source: Step-By-Step Example
de: Schritt für Schritt Anleitung

source: Step-By-Step-Example
de: Schritt für Schritt Anleitung

source: Strong Mode
de: Starker Modus

source: Strong Mode makes it hard to continue to the distracting App while the counter is still counting. Strong Mode is automatically active in Lockdown Mode.
de: Der Starke Modus erschwert es, die ablenkende App weiterhin zu nutzen, während der Timer noch läuft. Im Lockdown Modus ist der Starke Modus automatisch aktiviert.

source: Summary
de: Übersicht

source: Support Me
de: Unterstütze mich

source: Swipe down to search for "App" and select it
de: Wische runter um nach „App“ zu suchen

source: Swipe left or right to navigate between Steps.
de: Wische nach links oder rechts um zwischen den Schritten zu navigieren.

source: Tap here to download
de: Hier herunterladen

source: Thank you for choosing my app! It’s designed to help you stay focused by detecting when you spend too much time in distracting apps. If that happens, it gently intervenes by closing the app and asking you to take a short break before returning.
de: Danke, dass du meine App gewählt hast! Sie wurde entwickelt, um dir zu helfen, fokussiert zu bleiben, indem sie erkennt, wenn du zu viel Zeit in ablenkenden Apps verbringst. In diesem Fall greift sie sanft ein, indem sie die App schließt und dich auffordert, eine kurze Pause einzulegen, bevor du zurückkehren kannst.

source: Thank you for your trust and support — Lukas
de: Danke für dein Vertrauen und Deine Unterstützung — Lukas

source: The app is open-source, and you can find the complete source code here:
de: Die App ist Open Source, und du kannst den vollständigen Quellcode hier finden:

source: Timed Breaks
de: Geplante Pausen

source: Timer Duration %@ Seconds
de: Timer Dauer: %@ Sekunden

source: Timer Duration %d Seconds
de: Timer Dauer: %d Sekunden

source: Timer time %@ Seconds
de: ss

source: To make this work seamlessly, the app relies on Apple’s Shortcuts Automation. You’ll need to download and install a Shortcut for this feature to function. Don’t worry, it’s easy to set up, completely secure, and I don’t collect any of your personal data. Your privacy is my priority!
de: Damit alles nahtlos funktioniert, nutzt die App die Automatisierung von Apples Kurzbefehlen. Du musst einen Kurzbefehl herunterladen und installieren, damit diese Funktion verwendet werden kann. Keine Sorge, die Einrichtung ist einfach, vollkommen sicher, und ich sammelt keinerlei persönliche Daten. Deine Privatsphäre hat höchste Priorität!

source: What happens if I close the app while the timer is running?
de: Was passiert, wenn ich die App schließe, während der Timer läuft?

source: What is Lockdown Mode?
de: Was ist der Lockdown Modus?

source: What is Strong Mode?
de: Was ist der Strong Mode?

source: When Lockdown Mode is enabled, the app will strictly restrict access to distracting apps during the specified hours. You can change the allowed time later in Settings. Outside of Lockdown Mode, distracting apps will be closed after 5 minutes of use.
de: Wenn der Lockdown Modus aktiviert ist, wird der Zugriff auf ablenkende Apps während der festgelegten Stunden strikt eingeschränkt. Du kannst die erlaubte Zeit später in den Einstellungen ändern. Außerhalb des Lockdown-Modus werden ablenkende Apps nach 5 Minuten Nutzung geschlossen.

source: When not in Lockdown Mode, distracting Apps get closed after 5 Minutes
de: Wenn der Lockdown Modus aus ist, werden Zeitfresser-Apps nach 5 Minuten geschlossen

source: When Strong Mode is off, distracting apps close after 5 minutes but can be reopened immediately without restrictions.
de: Wenn der Strong Mode deaktiviert ist, werden ablenkende Apps nach 5 Minuten geschlossen, können aber sofort wieder ohne Einschränkungen geöffnet werden.

source: Where can I find the source code?
de: Wo kann ich den Quellcode finden?

source: Why does the app open sometimes after I close the distracting app?
de: Warum öffnet sich die App manchmal, nachdem ich die ablenkende App geschlossen habe?

source: You can buy me a coffee here:
de: Du kannst mir hier einen Kaffee kaufen:

source: You're stronger than any distraction, %@!
de: Du bist stärker als die Zeitfresser, %@!

source: You've made it this far, %@!
de: %@, lass Zeitfresser nicht gewinnen!

source: Your name
de: Dein Name

source: Your name helps us create supportive and personalized messages while you wait and stay strong. You can always update this information later in the settings.
de: Mit deinem Namen erstellen wir unterstützende Nachrichten während du wartest. Du kannst ihn später in den Einstellungen ändern.

source: Your Name:
de: Dein Name:
